tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4620_tdd.h
#define SEN                           522
#define RSEN                          523
#define PEN                           524
#define RCEN                          525
#define ACKEN                         526
#define ACKDT                         527
#define ACKSTAT                       528
#define GCEN                          529
#define SSPCON1                       530
#define SSPM0                         531
#define SSPM                          532
#define SSPM1                         533
#define SSPM2                         534
#define SSPM3                         535
#define CKP                           536
#define SSPEN                         537
#define SSPOV                         538
#define WCOL                          539
#define SSPSTAT                       540
#define BF                            541
#define UA                            542
#define R_NOT_W                       543
#define NOT_W                         544
#define nW                            545
#define RW                            546
#define nWRITE                        547
#define R                             548
#define W                             549
#define NOT_WRITE                     550
#define R_nW                          551
#define R_W                           552
#define START                         553
#define S                             554
#define STOP                          555
#define P                             556
#define A                             557
#define NOT_A                         558
#define nA                            559
#define D_A                           560
#define D_nA                          561
#define D                             562
#define DA                            563
#define D_NOT_A                       564
#define NOT_ADDRESS                   565
#define nADDRESS                      566
#define CKE                           567
#define SMP                           568
#define T2CON                         569
#define T2CKPS0                       570
#define T2CKPS                        571
#define T2CKPS1                       572
#define TMR2ON                        573
#define T2OUTPS0                      574
#define TOUTPS                        575
#define T2OUTPS1                      576
#define T2OUTPS2                      577
#define T2OUTPS3                      578
#define PR2                           579
#define WM0                           580
#define WM1                           581
#define WAIT0                         582
#define WAIT1                         583
#define EBDIS                         584
#define T1CON                         585
#define TMR1ON                        586
#define TMR1CS                        587
#define NOT_T1SYNC                    588
#define T1SYNC                        589
#define nT1SYNC                       590
#define T1OSCEN                       591
#define SOSCEN                        592
#define T1CKPS0                       593
#define T1CKPS                        594
#define T1CKPS1                       595
#define T1RUN                         596
#define T1CON_RD16                    597
#define T1RD16                        598
#define RCON                          599
#define BOR                           600
#define NOT_BOR                       601
#define nBOR                          602
#define POR                           603
#define nPOR                          604
#define NOT_POR                       605
#define PD                            606
#define nPD                           607
#define NOT_PD                        608
#define NOT_TO                        609
#define nTO                           610
#define TO                            611
#define nRI                           612
#define NOT_RI                        613
#define RI                            614
#define SBOREN                        615
#define IPEN                          616
#define WDTCON                        617
#define SWDTE                         618
#define SWDTEN                        619
#define HLVDCON                       620
#define HLVDL                         621
#define HLVDL0                        622
#define LVV0                          623
#define LVDL0                         624
#define HLVDL1                        625
#define LVDL1                         626
#define LVV1                          627
#define HLVDL2                        628
#define LVV2                          629
#define LVDL2                         630
#define HLVDL3                        631
#define LVV3                          632
#define LVDL3                         633
#define HLVDEN                        634
#define LVDEN                         635
#define BGST                          636
#define IRVST                         637
#define IVRST                         638
#define VDIRMAG                       639
#define OSCCON                        640
#define SCS0                          641
#define SCS                           642
#define SCS1                          643
#define IOFS                          644
#define OSTS                          645
#define IRCF                          646
#define IRCF0                         647
#define IRCF1                         648
#define IRCF2                         649
#define IDLEN                         650
#define T0CON                         651
#define T0PS                          652
#define T0PS0                         653
#define T0PS1                         654
#define T0PS2                         655
#define PSA                           656
#define T0SE                          657
#define T0CS                          658
#define T08BIT                        659
#define T016BIT                       660
#define TMR0ON                        661
#define STATUS                        662
#define C                             663
#define CARRY                         664
#define DC                            665
#define ZERO                          666
#define Z                             667
#define OV                            668
#define OVERFLOW                      669
#define N                             670
#define NEGATIVE                      671
#define INTCON3                       672
#define INT1IF                        673
#define INT1F                         674
#define INT2IF                        675
#define INT2F                         676
#define INT1E                         677
#define INT1IE                        678
#define INT2IE                        679
#define INT2E                         680
#define INT1P                         681
#define INT1IP                        682
#define INT2IP                        683
#define INT2P                         684
#define INTCON2                       685
#define RBIP                          686
#define TMR0IP                        687
#define INTEDG2                       688
#define INTEDG1                       689
#define INTEDG0                       690
#define RBPU                          691
#define NOT_RBPU                      692
#define nRBPU                         693
#define INTCON                        694
#define RBIF                          695
#define INT0F                         696
#define INT0IF                        697
#define T0IF                          698
#define TMR0IF                        699
#define RBIE                          700
#define INT0E                         701
#define INT0IE                        702
#define T0IE                          703
#define TMR0IE                        704
#define PEIE                          705
#define PEIE_GIEL                     706
#define GIEL                          707
#define GIE_GIEH                      708
#define GIE                           709
#define GIEH                          710
#define STKPTR0                       711
#define STKPTR                        712
#define SP0                           713
#define STKPTR1                       714
#define SP1                           715
#define STKPTR2                       716
#define SP2                           717
#define SP3                           718
#define STKPTR3                       719
#define STKPTR4                       720
#define SP4                           721
#define STKUNF                        722
#define STKOVF                        723
#define STKFUL                        724

#endif // _PIC18LF4620_H_
